package ITStep.homeworks.homework05;

/**
 * Created by roman on 25.09.2016.
 * Создайте метод public static void print(), который печатает ваше имя в консоль и запустите его из метода main.
 * Измените метод print так, чтобы он принимал имя как входящий параметр.
 */
public class homework0502 {

    public static void print(String name){
        System.out.println("My name is " + name + " !");
    }

    public static void main(String[] args) {

        print("Roman");

    }
}
