package ITStep.homeworks.homework05;

/**
 * Created by roman on 25.09.2016.
 * Создайте метод public static void print(), который печатает ваше имя в консоль и запустите его из метода main.
 */
public class homework0501 {

    public static void print(){
        System.out.println("My name is Roman!");
    }

    public static void main(String[] args) {

        print();
    }
}
